In [1]:
import pandas as pd

### Name, Address, and Age

['John Smith', 'Jane Doe', 'Joe Schmo']

['123 Main St.', '456 Maple Ave.', '789 Broadway']

[34, 28, 51]

In [3]:
df1 = pd.DataFrame({'name': ['John Smith', 'Jane Doe', 'Joe Schmo'], 'address' : ['123 Main St.', '456 Maple Ave.', '789 Broadway'] , 'age' : [34, 28, 51] })
df1

         name         address  age
0  John Smith    123 Main St.   34
1    Jane Doe  456 Maple Ave.   28
2   Joe Schmo    789 Broadway   51


1. You run an online clothing store called Pandaâ€™s Wardrobe. You need a DataFrame containing information about your products.

Create a DataFrame with the following data that your inventory manager sent you:

In [4]:
df = pd.DataFrame({'Product ID': [1,2,3,4], 'Product Name': ['t-shirt', 't-shirt' , 'skirt', 'skirt'], 'Color': ['blue', 'green', 'red', 'black']})
df

   Product ID Product Name  Color
0           1      t-shirt   blue
1           2      t-shirt  green
2           3        skirt    red
3           4        skirt  black

In [5]:
print(df)

   Product ID Product Name  Color
0           1      t-shirt   blue
1           2      t-shirt  green
2           3        skirt    red
3           4        skirt  black

In [10]:
# You can also add data using lists.

# For example, you can pass in a list of lists, where each one represents a row of data. 
# Use the keyword argument columns to pass a list of column names.

df2 = pd.DataFrame([['John Smith', '123 Main St.', 34],
                    ['Jane Doe', '456 Maple Ave.', 28],
                    ['Joe Schmo', '789 Broadway', 51]], 
                    columns=['name', 'address', 'age'])
df2

         name         address  age
0  John Smith    123 Main St.   34
1    Jane Doe  456 Maple Ave.   28
2   Joe Schmo    789 Broadway   51

In [13]:
#Constructing DataFrame from a dictionary.
d = {'col1': [1,2], 'col2': [3,4]}

df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [21]:
import numpy as np
dd = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
dd

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [19]:
#Constructing DataFrame from numpy ndarray:

df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'])

In [20]:
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9